Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ལ་ཡང་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་དངོས་པོ་མ་མཆིས་པའི་ངོ་བོ་ཉིད་ལགས་ན། དོན་ཅི་ཞིག་མཐོང་ཞིང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་རྣམས་ཀྱི་དོན་གྱི་སླད་དུ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འཇུག་པ་ལགས།
en: Chapter 60 The venerable Subhūti further asked the Blessed One, “Blessed Lord, if all phenomena have the essential nature of nonentity, what is the goal that bodhisattva great beings see in embarking on unsurpassed, complete enlightenment for the sake of beings?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཇི་ལྟར་ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཡིན་པ་དེ་ལྟར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འཇུག་སྟེ།
en: The Blessed One replied, “Subhūti, in the way that all phenomena have the essential nature of nonentity, in that way too do bodhisattva great beings embark on unsurpassed, complete enlightenment.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དམིགས་པ་ནི་རྒྱ་ཆུང་བ་སྟེ།
en: If you ask why, Subhūti, it is because apprehending is feeble.

source: དམིགས་པའི་འདུ་ཤེས་ཅན་ཐོབ་པ་མེད་དོ། །མངོན་པར་རྟོགས་པ་མེད་དོ། །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མེད་དོ།
en: Those possessing the notion of apprehending are without attainment, without clear realization, and without unsurpassed complete enlightenment.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་དམིགས་པ་མ་མཆིས་པ་ལ་ཐོབ་པ་འམ། མངོན་པར་རྟོགས་པ་འམ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མཆིས་སམ།
en: Blessed Lord, with regard to nonapprehension, is there attainment, clear realization, or unsurpassed, complete enlightenment?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཆོས་ཀྱི་དབྱིངས་ལ་རྣམ་པར་འཁྲུག་པ་མེད་པའི་ཕྱིར། མི་དམིགས་པ་ཉིད་ཐོབ་པའོ། །མི་དམིགས་པ་ཉིད་མངོན་པར་རྟོགས་པའོ། །མི་དམིགས་པ་ཉིད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བོ།
en: Subhūti,” replied the Blessed One, “it is because the realm of phenomena is without agitation that nonapprehension is attainment, that nonapprehension is clear realization, and that nonapprehension is unsurpassed, complete enlightenment.

source: །གང་མི་དམིགས་པ་ལ་འཐོབ་པ་འམ། མངོན་པར་རྟོགས་པ་འམ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདོད་པ་དེ་ནི། ཆོས་ཀྱི་དབྱིངས་ལ་རྣམ་པར་དཀྲུག་པར་འདོད་དུ་ཟད་དོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་དམིགས་པ་མ་མཆིས་པ་ལ་ཡང་འཐོབ་པ་མ་མཆིས།
en: Those who wish to attain that which is without apprehending, or to have clear realization of it, or to attain unsurpassed, complete enlightenment with respect to it, merely wish to agitate the realm of phenomena.” {

source: མངོན་པར་རྟོགས་པ་མ་མཆིས།
en: Ki.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མ་མཆིས་ལ། མི་དམིགས་པ་ཉིད་འཐོབ་པ། མི་དམིགས་པ་ཉིད་མངོན་པར་རྟོགས་པ། མི་དམིགས་པ་ཉིད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལགས་ན། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ས་དང་པོ་ཡང་ག་ལ་མཆིས།
en: VI: 13} “Blessed Lord, if in that manner there is no attainment, no clear realization, and no unsurpassed, complete enlightenment with respect to that which is without apprehending, but nonetheless nonapprehension is attainment, nonapprehension is clear realization, and nonapprehension is unsurpassed, complete enlightenment, how then, Blessed Lord, could there possibly be bodhisattva great beings of the first level?

source: ས་གཉིས་པ་ཡང་ག་ལ་མཆིས། ས་གསུམ་པ་ཡང་ག་ལ་མཆིས།
en: How could there possibly be [bodhisattva great beings] of the second level, how could there possibly be [bodhisattva great beings] of the third level, and so on?

source: ས་བཅུ་པའི་བར་དུ་ཡང་ག་ལ་མཆིས།
en: How could there possibly be [bodhisattva great beings] of the tenth level?

source: མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཡང་ག་ལ་མཆིས།
en: How could there possibly be acceptance that phenomena are nonarising?

source: རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་མངོན་པར་ཤེས་པ་ཡང་ག་ལ་མཆིས།
en: How could there possibly be extrasensory powers that derive from maturation?

source: རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་སྦྱིན་པ་ཡང་ག་ལ་མཆིས།
en: How could there possibly be generosity that derives from maturation?

source: རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་།
en: How could there possibly be ethical discipline, tolerance, perseverance, or meditative concentration that derive from maturation?

source: རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་ཤེས་རབ་ཀྱང་ག་ལ་མཆིས།
en: How could there possibly be wisdom that derives from maturation?

source: རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱང་ག་ལ་མཆིས་ཏེ། རྣམ་པར་སྨིན་པའི་ཆོས་དེ་དག་ལ་གནས་ཤིང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བགྱིད་པ་དང་། སངས་རྒྱས་བཅོ
en: How could there possibly be the thirty-seven factors conducive to enlightenment that derive from maturation?

source: མ་ལྡན་འདས་རྣམས་ལ་ཞལ་ཟས་དང་། བཏུང་བ་དང་། ན་བཟའ་དང་། གཟིམས་ཆ་དང་། ཕོ་བྲང་དང་། ཡོ་བྱད་དང་། མེ་ཏོག་དང་། བདུག་སྤོས་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ཆོས་གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། མར་མེ་དང་། ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་གཞན་གང་ཡང་རུང་བ་དག་གིས་རིམ་གྲོ་བགྱིད་ཅིང་། དེ་ལ་དེ་དག་རྒྱུན་མི་ཆད་པར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་བར་དུ་སྐུ་གདུང་དང་། ཉན་ཐོས་དག་ལ་རྣམ་པར་སྨིན་པར་གྱུར་ཀྱང་བས་པར་མི་འགྱུར་ན། བཅོམ་ལྡན་འདས་དེའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱི་དབྱིངས་རྣམ་པར་དཀྲུག་པར་བགྱིད་པར་མི་འགྱུར་རམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གང་གི་ཕྱིར་མི་དམིགས་པ་དེ་ཉིད་ཀྱི་ཕྱིར།
en: If, abiding in these maturational attributes, they bring beings to maturity, refine the buddhafields, and serve the lord buddhas with food, drink, clothing, bedding, palaces, resources, flowers, incense, perfume, garlands, unguents, powders, religious robes, parasols, victory banners, banners, butter lamps, or any other worthy excellences of gods and humans, and do so without interruption until final nirvāṇa is attained, and their [virtuous actions] are not exhausted even after being matured with respect to the sacred relics [of the buddhas] and the śrāvakas, how then, Blessed Lord, will bodhisattva great beings not agitate the realm of phenomena?”

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱི་དབྱིངས་རྣམ་པར་འཁྲུག་པར་མི་བྱེད་དེ། དེ་ཉིད་ཀྱི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ས་དང་པོའོ། །དེ་ཉིད་ཀྱི་ཕྱིར་ས་གཉིས་པ་དང་། ས་གསུམ་པ་དང་། ས་བཅུ་པ་ཉིད་ཀྱི་བར་དུའོ། །དེ་ཉིད་ཀྱི་ཕྱིར་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པའོ། །དེ་ཉིད་ཀྱི་ཕྱིར་རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་མངོན་པར་ཤེས་པའོ།
en: The Blessed One replied, “It is because bodhisattva great beings do not agitate the realm of phenomena owing to nonapprehension that there is the first level of bodhisattva great beings, that there is the second level, the third level, and so on, up to and including the tenth level.

source: །དེ་ཉིད་ཀྱི་ཕྱིར་རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་བོ། །དེ་ཉིད་ཀྱི་ཕྱིར་རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་སོ། །དེ་ཉིད་ཀྱི་ཕྱིར་རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་དགེ་བའི་རྩ་བ་རྣམས་ཏེ། དགེ་བའི་རྩ་བ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་དེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་ཡང་ཞལ་ཟས་དང་། བཏུང་བ་དང་། ན་བཟའ་དང་། གཟིམས་ཆ་དང་། ཕོ་བྲང་དང་། ཡོ་བྱད་དང་། མེ་ཏོག་དང་། བདུག་སྤོས་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ཆོས་གོས་དང་།
en: It is for this reason that there is acceptance that phenomena are nonarising; that there are extrasensory powers that derive from maturation; that there are generosity, ethical discipline, tolerance, perseverance, meditative concentration, and wisdom that derive from maturation; that there are the thirty-seven factors conducive to enlightenment that derive from maturation; and that there are the roots of virtuous action that derive from maturation.

source: གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། མར་མེ་དང་། ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་གཞན་གང་ཡང་རུང་བ་དག་གིས་རིམ་གྲོ་བྱེད་ཅིང་། དེ་ལ་དེ་དག་རྒྱུན་མི་ཆད་པར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱི་བར་དུ་སྐུ་གདུང་དང་། ཉན་ཐོས་དག་ལ་རྣམ་པར་སྨིན་པར་གྱུར་ཀྱང་། ཟད་པར་མི་འགྱུར་རོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་མི་དམིགས་པ་དང་། སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་།
en: It is through these roots of virtuous action that bodhisattva great beings bring beings to maturity, refine the buddhafields, and serve the lord buddhas with food, drink, clothing, bedding, palaces, resources, flowers, incense, perfume, garlands, unguents, powders, religious robes, parasols, victory banners, banners, butter lamps, and any other worthy excellences of gods and humans, and do so without interruption until final nirvāṇa is attained, and that these are not exhausted even after being matured with respect to the sacred relics [of the buddhas] and the śrāvakas.” “

source: བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ལ་བྱེ་བྲག་ནི་ཅི་ཞིག་མཆིས། ཐ་དད་དུ་བགྱི་བ་ནི་ཅི་ཞིག་མཆིས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་མི་དམིགས་པ་དང་།
en: Blessed Lord, what is the distinction and what is the difference between nonapprehension on the one hand and generosity, ethical discipline, tolerance, perseverance, meditative concentration, wisdom, and extrasensory powers on the other?” {

source: སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་།
en: Ki.

source: བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ལ་ཐ་དད་དུ་བྱ་བ་གང་ཡང་མེད་དོ།
en: VI: 14} “Subhūti,” replied the Blessed One, “there is no difference at all between nonapprehension on the one hand and generosity, ethical discipline, tolerance, perseverance, meditative concentration, wisdom, and immaculate extrasensory powers on the other.

source: །རབ་འབྱོར་གོས་པ་མེད་པའི་སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་དང་། གོས་པ་མེད་པའི་མངོན་པར་ཤེས་པ་དག་ལ་ནི་ཐ་དད་དུ་བྱ་བར་བསྟན་ཏོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་གོས་པ་མ་མཆིས་པའི་སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་།
en: And yet, Subhūti, immaculate generosity, ethical discipline, tolerance, perseverance, meditative concentration, wisdom, and immaculate extrasensory powers, are revealed to be different.” “

source: བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ཇི་ལྟར་ཐ་དད་དུ་བགྱི་བར་བསྟན།
en: Blessed Lord, how are immaculate generosity, ethical discipline, tolerance, perseverance, meditative concentration, wisdom, and extrasensory powers revealed to be different?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སྦྱིན་པ་མི་དམིགས། གཏོང་བ་མི་དམིགས། གཏོང་བ་པོ་མི་དམིགས།
en: In this regard, Subhūti,” replied the Blessed One, “when bodhisattva great beings practice the perfection of wisdom, they give gifts without apprehending gifts, without apprehending the act of giving, without apprehending the giver, and without apprehending the recipient.

source: ལེན་པ་པོ་མི་དམིགས་པར་སྦྱིན་པ་གཏོང་ངོ་། །ཚུལ་ཁྲིམས་མི་དམིགས་པར་ཚུལ་ཁྲིམས་སྲུང་ངོ་།
en: They maintain ethical discipline without apprehending ethical discipline.

source: །བཟོད་པ་མི་དམིགས་པར་བཟོད་པ་སྒྲུབ་བོ།
en: They practice tolerance without apprehending tolerance.

source: །བརྩོན་འགྲུས་མི་དམིགས་པར་བརྩོན་འགྲུས་རྩོམ་མོ།
en: They undertake perseverance without apprehending perseverance.

source: །ཏིང་ངེ་འཛིན་མི་དམིགས་པར་སྙོམས་པར་འཇུག་གོ །
en: They become absorbed without apprehending meditative stability.

source: ཤེས་རབ་མི་དམིགས་པར་ཤེས་རབ་སྒོམ་མོ།
en: They cultivate wisdom without apprehending wisdom.

source: །མངོན་པར་ཤེས་པ་མི་དམིགས་པར་མངོན་པར་ཤེས་པ་རྣམས་ལ་སྤྱོད་དོ།
en: They practice extrasensory powers without apprehending extrasensory powers.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་མི་དམིགས་པར་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་སྤྱོད་དོ། །ཡང་དག་པར་སྤོང་བ་དང་།
en: They practice the applications of mindfulness without apprehending the applications of mindfulness.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ལམ་མི་དམིགས་པར་ལམ་ལ་སྤྱོད་དོ།
en: They practice the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the path without apprehending the path [and so forth].

source: །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་མི་དམིགས་པར་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ལ་སྤྱོད་དོ།
en: They practice the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions without apprehending the formless absorptions [and so forth].

source: །རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་མི་དམིགས་པར། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ལ་སྤྱོད་དོ།
en: They practice the aspects of liberation and the serial steps of meditative absorption without apprehending the serial steps of meditative absorption [and so forth].

source: །སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་མི་དམིགས་པར། སྨོན་པ་མེད་པ་ལ་སྤྱོད་དོ། །མངོན་པར་ཤེས་པ་རྣམས་དང་།
en: They practice emptiness, signlessness, and wishlessness without apprehending wishlessness [and so forth].

source: ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་མི་དམིགས་པར་སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་ལ་སྤྱོད་དོ།
en: They practice the extrasensory powers, meditative stabilities, dhāraṇī gateways, powers of the tathāgatas, fearlessnesses, and kinds of exact knowledge without apprehending the kinds of exact knowledge [and so forth].

source: །བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་མི་དམིགས་པར་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་སྤྱོད་དོ།
en: They practice great loving kindness, great compassion, and the distinct qualities of the buddhas without apprehending the distinct qualities of the buddhas [and so forth].

source: །སེམས་ཅན་རྣམས་མི་དམིགས་པར་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ།
en: They bring beings to maturity without apprehending beings.

source: །སངས་རྒྱས་ཀྱི་ཞིང་མི་དམིགས་པར་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་དོ།
en: They refine the buddhafields without apprehending the buddhafields.

source: །སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་མི་དམིགས་པར་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: They attain consummate buddhahood in enlightenment without apprehending the attributes of the buddhas.

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མི་དམིགས་པའི་ཚུལ་གྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ།
en: It is in this way, Subhūti, that bodhisattva great beings practice the perfection of wisdom without apprehending anything.

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་ན། དེ་ལ་བདུད་སྡིག་ཏོ་ཅན་རྣམས་སམ། བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་ཚུགས་པར་དཀའ་བ་ཡིན་ནོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས།
en: Subhūti, when bodhisattva great beings practice the perfection of wisdom in that manner, it will be difficult for evil Māra or the gods of the domain of Māra to intrude.

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཇི་ལྟར་སེམས་བསྐྱེད་པ་གཅིག་གིས་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་འཛིན་པ་ལགས། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡོངས་སུ་འཛིན་པ་ལགས།
en: VII: 15} The venerable Subhūti then asked the Blessed One, “Blessed Lord, when bodhisattva great beings practice the perfection of wisdom, how do they acquire the six perfections through a single setting of their minds on enlightenment, and how do they [similarly] acquire the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path?

source: རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། མངོན་པར་ཤེས་པ་ལྔ་ཡོངས་སུ་འཛིན་པ་ལགས།
en: How do they [similarly] acquire the three gateways of liberation, the four truths of the noble ones, the eight aspects of liberation, the nine serial steps of meditative absorption, and the five extrasensory powers?

source: ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་འཛིན་པ་ལགས།
en: How do they [similarly] acquire the emptiness of internal phenomena, the emptiness of external phenomena, the emptiness of external and internal phenomena, and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities?

source: ཏིང་ངེ་འཛིན་རྣམས་དང་གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་།
en: How do they [similarly] acquire the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, the eighteen distinct qualities of the buddhas, the thirty-two major marks of a great person, and the eighty minor marks?” “

source: མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ཡོངས་སུ་འཛིན་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སྦྱིན་པ་གང་གཏང་བ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་ཟིན་པ་ལས་གཞན་དུ་མ་ཡིན་ནོ།
en: In this regard, Subhūti,” replied the Blessed One, “whatever gifts bodhisattva great beings may dispense, these are not acquired by anything other than the perfection of wisdom.

source: །ཚུལ་ཁྲིམས་གང་སྲུང་བ་དང་། བཟོད་པ་གང་སྒོམ་པ་དང་། བརྩོན་འགྲུས་གང་རྩོམ་པ་དང་། ཏིང་ངེ་འཛིན་གང་ལ་སྙོམས་པར་འཇུག་པ་དང་། ཤེས་རབ་གང་སྒོམ་པ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་ཟིན་པ་ལས་གཞན་དུ་མ་ཡིན་ནོ། །བསམ་གཏན་རྣམས་
en: Whatever ethical discipline is kept, whatever tolerance is cultivated, whatever perseverance is undertaken, whatever meditative stability is maintained, and whatever wisdom is cultivated, these are not acquired by anything other than the perfection of wisdom.

source: དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ལ་གང་སྙོམས་པར་འཇུག་པ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་གང་སྒོམ་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་གང་སྒོམ་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། འཕགས་པའི་བདེན་པ་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། མངོན་པར་ཤེས་པ་རྣམས་ལ་གང་སྒོམ་པ་དེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་ཟིན་པ་ལས་གཞན་དུ་མ་ཡིན་ནོ། །ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་གང་སྒོམ་པ་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་།
en: In whichever meditative concentrations, immeasurable attitudes, and formless absorptions one is absorbed; whatever applications of mindfulness are cultivated; whatever correct exertions, supports for miraculous ability, faculties, powers, branches of enlightenment, and noble eightfold path are cultivated; and whatever three gateways of liberation, truths of the noble ones, aspects of liberation, serial steps of meditative absorption, and extrasensory powers are cultivated, these are not acquired by anything other than the perfection of wisdom.

source: མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་གང་སྒོམ་པ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་ཟིན་པ་ལས་གཞན་དུ་མ་ཡིན་ནོ།
en: Whatever aspects of emptiness are cultivated—from the emptiness of internal phenomena up to and including the emptiness of the essential nature of nonentities—and whatever meditative stabilities, dhāraṇī gateways, powers of the tathāgatas, fearlessnesses, kinds of exact knowledge, great loving kindness, great compassion, and eighteen distinct qualities of the buddhas are cultivated, these are not acquired by anything other than the perfection of wisdom.

source: །མཚན་རྣམས་དང་། དཔེ་བྱད་བཟང་པོ་རྣམས་གང་མངོན་པར་སྒྲུབ་པ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ཡོངས་སུ་ཟིན་པ་ལས་གཞན་དུ་མ་ཡིན་ནོ།
en: Whatever major marks and excellent minor marks are brought into being, these are not acquired by anything other than the perfection of wisdom.

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་པ་ནི། སེམས་བསྐྱེད་པ་གཅིག་གིས་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: Subhūti, bodhisattva great beings who practice the perfection of wisdom in that manner perfect the six perfections through a single setting of the mind on enlightenment, and [similarly] they perfect the meditative concentrations, the immeasurable attitudes, and the formless absorptions.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: They [similarly] perfect the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path.

source: །རྣམ་པར་ཐར་པའི་སྒོ་རྣམས་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། མངོན་པར་ཤེས་པ་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། སྟོབས་རྣམས་དང་།
en: They [similarly] perfect the gateways of liberation, the truths of the noble ones, the aspects of liberation, the serial steps of meditative absorption, and the extrasensory powers.

source: མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: They [similarly] perfect the emptiness of internal phenomena and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, the meditative stabilities, the dhāraṇī gateways, the powers [of the tathāgatas], the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas.

source: །མི་ཆེན་པོའི་མཚན་རྣམས་དང་། དཔེ་བྱད་བཟང་པོ་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: They [similarly] perfect the major marks of a great person and the excellent minor marks.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་ཡོངས་སུ་ཟིན་པ་དེ། སེམས་བསྐྱེད་པ་གཅིག་གིས་ཇི་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་འཛིན་པ་ལགས།
en: Blessed Lord, how, through a single setting of the mind on enlightenment, do bodhisattva great beings who have been embraced by the perfection of wisdom acquire the six perfections?

source: བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ཡོངས་སུ་འཛིན་པ་ལགས། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: How do they acquire the meditative concentrations, the immeasurable attitudes, and the formless absorptions?

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡོངས་སུ་འཛིན་པ་ལགས།
en: How do they acquire the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path?

source: རྣམ་པར་ཐར་པའི་སྒོ་རྣམས་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། མངོན་པར་ཤེས་པ་རྣམས་ཡོངས་སུ་འཛིན་པ་ལགས།
en: How do they acquire the gateways of liberation, the truths of the noble ones, the aspects of liberation, the serial steps of meditative absorption, and the extrasensory powers?

source: སྟོང་པ་ཉིད་ཐམས་ཅད་ཡོངས་སུ་འཛིན་པ་ལགས།
en: How do they acquire all the aspects of emptiness?

source: ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་།
en: How do they acquire the meditative stabilities, the dhāraṇī gateways, {Ki.
